Revit 2027 API
AssetSet.Erase Method
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	Asset item
)
Public Overridable Function Erase (
	item As Asset
) As Integer
public:
virtual int Erase(
	Asset^ item
)
abstract Erase :
        item : Asset -> int
override Erase :
        item : Asset -> int
Parameters
item Asset
Return Value
Int32
See Also
Reference
AssetSet Class
Autodesk.Revit.DB.Visual Namespace